Public Attributes | List of all members
API_LayoutInfo Struct Reference
Project Navigator
Properties of an Archicad Layout. More...
#include <APIdefs_Environment.h>
 Public Attributes
GS::uchar_t  | layoutName [API_UniLongNameLen]
The name of the layout as a Unicode string.
double  | sizeX
Horizontal size of the layout in mm.
double  | sizeY
Vertical size of the layout in mm.
double  | leftMargin
Layout margin to the left side of the paper.
double  | topMargin
Layout margin to the top side of the paper.
double  | rightMargin
Layout margin to the right side of the paper.
double  | bottomMargin
Layout margin to the bottom side of the paper.
char  | customLayoutNumber [256]
Corresponds to the Custom ID field on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
bool  | customLayoutNumbering
Corresponds to the Use Automatic Book and Subset ID numbering / Custom ID radio buttons on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
bool  | doNotIncludeInNumbering
Corresponds to state of the Do not include this Layout in ID sequence check box on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
bool  | showMasterBelow
Display master layout above or below the layout.
UInt32  | layoutPageNumber
Number of layout (page) when this layout contains any MultiPage Drawing. (Drawing with "Split to more layouts" flag.)
UInt32  | actPageIndex
The actual index of layout (page) inside the Multi Page Layout. (Layout what contains any drawing with "Split to more layouts" flag.)
GS::HashTable< API_Guid, GS::UniString > *  | customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
GS::uchar_t  | currentRevisionId [API_UniLongNameLen]
ID of the current document revision of the layout.
GS::uchar_t  | currentFinalRevisionId [API_UniLongNameLen]
EID with optional suffix (- WIP) of the current document revision of the layout.
bool  | hasIssuedRevision
One or more issued document revisions have already been created for the layout.
bool  | hasActualRevision
Exists an opened document revision for the layout.
Detailed Description
Properties of an Archicad Layout.
Remarks
You can retrieve and modify the properties of a layout with the ACAPI_Navigator_GetLayoutSets and ACAPI_Navigator_ChangeLayoutSets environment functions, respectively. Note that the paper size and margins are expressed in **mm**s, not in meters, and these parameters always apply to master layouts.
 Layout ID assigment tab page
 Do not forget do delete the customData pointer after calling ACAPI_Navigator_GetLayoutSets.
Member Data Documentation
◆ actPageIndex
 API_LayoutInfo::actPageIndex
The actual index of layout (page) inside the Multi Page Layout. (Layout what contains any drawing with "Split to more layouts" flag.)
◆ bottomMargin
 API_LayoutInfo::bottomMargin
Layout margin to the bottom side of the paper.
◆ currentFinalRevisionId
 API_LayoutInfo::currentFinalRevisionId
EID with optional suffix (- WIP) of the current document revision of the layout.
◆ currentRevisionId
 API_LayoutInfo::currentRevisionId
ID of the current document revision of the layout.
◆ customData
 API_LayoutInfo::customData
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
◆ customLayoutNumber
 API_LayoutInfo::customLayoutNumber
Corresponds to the Custom ID field on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
◆ customLayoutNumbering
 API_LayoutInfo::customLayoutNumbering
Corresponds to the Use Automatic Book and Subset ID numbering / Custom ID radio buttons on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
◆ doNotIncludeInNumbering
 API_LayoutInfo::doNotIncludeInNumbering
Corresponds to state of the Do not include this Layout in ID sequence check box on the Layout ID assignment tab page in the Layout Settings dialog (see picture below).
◆ hasActualRevision
 API_LayoutInfo::hasActualRevision
Exists an opened document revision for the layout.
◆ hasIssuedRevision
 API_LayoutInfo::hasIssuedRevision
One or more issued document revisions have already been created for the layout.
◆ layoutName
 API_LayoutInfo::layoutName
The name of the layout as a Unicode string.
◆ layoutPageNumber
 API_LayoutInfo::layoutPageNumber
Number of layout (page) when this layout contains any MultiPage Drawing. (Drawing with "Split to more layouts" flag.)
◆ leftMargin
 API_LayoutInfo::leftMargin
Layout margin to the left side of the paper.
◆ rightMargin
 API_LayoutInfo::rightMargin
Layout margin to the right side of the paper.
◆ showMasterBelow
 API_LayoutInfo::showMasterBelow
Display master layout above or below the layout.
◆ sizeX
 API_LayoutInfo::sizeX
Horizontal size of the layout in mm.
◆ sizeY
 API_LayoutInfo::sizeY
Vertical size of the layout in mm.
◆ topMargin
 API_LayoutInfo::topMargin
Layout margin to the top side of the paper.